import Container from "../Components/Container";
import HeroImgXs from "../assets/Hero-xs.png";
import HeroImgMd from "../assets/hero-md.png";
import HeroImgLg from "../assets/hero-lg.png";
import Title from "../Components/Title";
import Button from "../Components/Button";
import HeroSwipeImage from "../Components/HeroSwipeImage";
import FeatureItems from "../Components/FeatureItems";
import MyComponentMap from "../Components/Map";
// import data from "../fakejson/news.json";
// import NewsItems from "../Components/NewsItems";
import Faqs from "../Components/Faqs";
import ContactInfo from "../Components/ContactInfo";
// import ContactForm from "../Components/ContactForm";
function App() {
  // function fnc() {
  //   console.log("propsoor damjsan function");
  // }
  // let newsArr = [];
  // for (let i = 0; i < 6; i++) {
  //   newsArr.push(data[i]);
  // }

  return (
    <div>
      <Container>
        <main className="w-full flex flex-col lg:flex-row lg:mt-14 ">
          <div className="lg:w-6/12 mx-auto">
            <h1 className="text-white text-3xl text-center font-semibold mt-7 w-8/12 mx-auto md:text-5xl  lg:text-left lg:w-full lg:leading-normal">
              Цахим даатгал зуучлалын систем
            </h1>
            <p
              className="text-gray-400 text-center mx-auto mt-4 mb-8 font-lg md:w-8/12 lg:text-left lg:w-8/12
            lg:mx-0 lg:leading-normal lg:text-lg "
            >
              Бид даатгалын үйлчилгээний хүртээмжийг нэмэгдүүлэх, өртгийг
              бууруулж, шуурхай найдвартай үйлчилгээг харилцагчдад хүргэх
              зорилготой...
            </p>
            <div className="flex flex-col items-center lg:flex-row lg:justify-start">
              <Button
                link="/onlineInsurance"
                color="blue-500"
                hover="bg-blue-700"
                text="Цахим даатгал"
              />
              <Button
                link="/InsuranceCompare"
                hover="border-blue-500"
                text="Даатгалын статистик"
              />
            </div>
          </div>

          <img
            className="mx-auto w-10/12 md:max-w-lg  lg:w-full"
            src={HeroImgLg}
            alt="images"
          />
        </main>
        <div className="my-20 md:my-32 lg:my-40">
          <HeroSwipeImage />
        </div>
        <section>
          <Title text="Бидний тухай" color="blue-500" />
          <FeatureItems />
        </section>
        {/* <div className="flex justify-between items-center">
          <Title text="Мэдээ мэдээлэл" color="blue-500" />
          <a href="/news" className="mr-4 mt-40">
            <Button
            
              color="blue-500"
              hover="bg-blue-700"
              text="Бүх мэдээг үзэх"
            />
          </a>
        </div> */}

        {/* <div className="text-white grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 mb-8 ">
          {newsArr.map((e) => {
            return (
              <NewsItems
                imgUrl={e.img}
                title={e.title}
                date={e.date}
                url={e.url}
              />
            );
          })}
        </div> */}
        <Title text="Түгээмэл асуулт хариулт" color="blue-500" />
        <Faqs
          question="Даатгал гэж юу вэ?"
          answer="Хүн бүр амь нас, эрүүл мэнд, өмч хөрөнгөө хамгаалахын тулд учирч болох эрсдэлээс сэргийлдэг хэдий ч “Гай газар дороос” гэдэг шиг аливаа өвчин зовлон, аюул осол хэлж ирдэггүй хийсэж ирдэг. Энэ үед хүн сэтгэл санааны, бие махбодийн, эд хөрөнгийн хохирол амсаж, түүнийг барагдуулах, даван туулахад тодорхой хэмжээний санхүүгийн дарамт үүсдэг. Иймээс аливаа хувь хүн, албан байгууллагын хэвийн байдлыг алдагдуулах, санамсаргүй, эрсдэл дагуулсан үйл явцаас үүсэх хохирлыг бууруулах, нөхөх санхүүгийн үр дүнтэй арга хэрэгсэл бол даатгал юм."
        />
        <Faqs
          question="Ямар эрсдэлийг даатгах вэ?"
          answer="Хувь хүний эрсдэл - Амь нас, эрүүл мэнд учирч болзошгүй эрсдлүүд.
Жишээ нь: автомашины осолд өртөх, өвчин тусах г.м.
Эд хөрөнгийн эрсдэл - Таны эд хөрөнгөд бүрэн буюу хэсэгчлэн хохирол
учруулж болзошгүй эрсдлүүд.
Жишээ нь: хулгайд юмаа алдах, орон гэр нь гал түймэрт өртөх г.м.
Хариуцлагын эрсдэл - Аливаа хариуцлагагүй болон санаандгүй үйлдлээс
болж бусдын эд хөрөнгө, эрүүл мэндэд хохирол учруулж болзошгүй
эрсдлүүд.
Жишээ нь: автомашин жолоодож байхдаа бусдыг гэмтээх, эд хөрөнгөд нь
хохирол учруулах г.м.
Даатгалд хамрагддаггүй эрсдлийн төрлүүд:
Элэгдэл, хорогдол
Техникийг шалган турших явцад гарсан хохирол
Хувь сэтгэл санааны хохирол, байгууллагын нэр хүндийн эрсдэл
"
        />
        <Faqs
          question="Жолоочийн хариуцлагын даатгал гэж юу вэ?  Заавал даатгуулах шаардлагатай юу?
"
          answer="   	Энэхүү даатгал нь Жолоочийн Даатгалын Тухай Хуулиар зохицуулагддаг бөгөөд зам, тээврийн ослын улмаас бусдын амь нас, эрүүл мэнд, эд хөрөнгөнд учирсан хохирлыг нөхөн төлүүлэх, хохирогчийн эрхийг хамгаалах зорилготой албан журмын даатгал юм."
        />
        <Faqs
          question="Жолоочийн хариуцлагын албан журмын даатгал ямар хохирлыг барагдуулах вэ?"
          answer="хариулт 1"
        />
        <Faqs
          question="Шинээр машин аваад тээврийн хэрэгслийн гэрчилгээ, улсын дугаар авахаасаа өмнө даатгал хийлгэх /гэрчилгээ, улсын дугаар шаардагддаг/ шаардлага гарвал яаж асуудлыг шийдвэрлэх вэ?"
          answer="Даатгалын гэрээг эхлээд хийлгэх шаардлагатай бөгөөд шинэ тээврийн хэрэгслийн хувьд даатгагч тээврийн хэрэгслийн арлын дугаараар даатгалыг хийж, техникийн хяналтын үзлэг оношлогоонд орж, улсын дугаар авсны дараагаар даатгуулагч даатгагчид эргэж мэдэгдэн даатгалын гэрээ, мэдээллийн санд мэдээллийг бүрэн хэмжээнд нөхөн оруулах боломжтой.
          "
        />
        <Faqs
          question="Хэрэв даатгуулагч автомашинаа жилийн дундуур зарсан тохиолдолд даатгалд төлсөн төлбөрөө хэрхэн буцааж авах вэ?"
          answer="Даатгуулагч даатгалын хугацаа дуусахаас өмнө автомашинаа зарсан тохиолдолд даатгалын гэрээг цуцалж үлдэх хураамжийг өөртөө авч болно. Даатгал цуцлах үеийн даатгуулагчид үлдэх хураамж нь ашигласан хугацааны хураамж, олгосон нөхөн төлбөрийн дүн, даатгалын компанийн үйл ажиллагааны зардлыг хассан дүн байна."
        />
        <Faqs
          question="Тээврийн хэрэгслийн даатгал гэж юу вэ?"
          answer="Тээврийн хэрэгсэл эзэмшдэг жолооч бүр сайн дураар өөрсдийн тээврийн хэрэгсэлд учирсан аливаа гэнэтийн осол, аваараас үүдэн гарсан хохирлыг нөхөн төлөх нөхцөлтэй даатгал юм. Жолоочийн хариуцлагын албан журмын даатгалаар бусдын тээврийн хэрэгслийг хамгаалсан бол энэхүү даатгалаар та өөрийн тээврийн хэрэгсэлд учирсан эрсдэлээс бүрэн хамгаалах боломжтой."
        />
        <Faqs
          question="Тээврийн хэрэгслийн даатгал яагаад хийлгэх хэрэгтэй вэ?"
          answer="Замын хөдөлгөөн бол тэр чигтээ эрсдэл, хариуцлага дунд өрнөж байдаг. Магадгүй зарим нь албан журмын жолооочийн хариуцлагын даатгалаар учирж болох олон төрлийн эрсдэлийг бууруулж болно гэж төсөөлж магадгүй. Гэвч уг даатгал нь зөвхөн таны бусдад учруулсан хохирлыг нөхөн барагдуулах зорилго бүхий заавал хийлгэх ёстой даатгалын нэг юм. Үүнээс гадна гэр бүл, өөрт тань хөрөнгө оруулалт болохуйц даатгал бол “Тээврийн хэрэгслийн даатгал” билээ.  Уг даатгалын тээврийн хэрэгсэлд бүрэн хамгаалалтыг санал болгодог бодлого нь гол давуу тал юм."
        />
        <Faqs
          question="Жолоочийн даатгалд тээврийн хэрэгслийн эзэмшигчээс гадна хэдэн жолоочийн нэр нэмүүлж болох вэ?"
          answer="5  хүртэлх жолоочийн нэр нэмүүлж болно.
          "
        />
        <Faqs
          question="Даатгуулахад ямар бичиг баримт шаардлагатай вэ?"
          answer="Эзэмшигч өөрөө бол тээврийн хэрэгслийн гэрчилгээ болон жолооны үнэмлэх."
        />
        <Faqs
          question="Нэр шилжүүлэх тохиолдолд яах вэ?"
          answer="Нэр шилжүүлэх боломжгүй. Даатгалын хуучин гэрээнд буцаалт хийж буцаалт хийсэн өдрөөс гэрээний хугацаа дуусах хугацаа хүртэлх зөрүү мөнгийг буцаан төлж шинэ жолооч дахин даатгалын гэрээ байгуулах боломжтой."
        />
        <Faqs
          question="Улсын оношилгоонд ороход жолоочийн даатгалд хамрагдсан байх ёстой юу?"
          answer="Жолоочийн даатгал хийлгэсэн тохиолдолд л оношилгоонд орно."
        />
        <Faqs
          question="Зам тээврийн ослын үед ямар арга хэмжээг авах шаардлагатай вэ?"
          answer="1 алхам: Замын цагдаагийн 102, 124 утсанд ослын дуудлага өгч, хэмжилт хийлгэн буруутай этгээдийг тогтоолгох
          2 алхам: Даатгуулсан компанийхаа утсанд дуудлага өгч үзлэг хийлгэх
          3 алхам: Хохирлын үнэлгээг эрх бүхий байгууллагаар гаргуулах
          4 алхам: Осолд холбогдогч талууд дараах бичиг баримтыг бүрдүүлэн даатгалын компанид хүлээлгэн өгнө. Үүнд:
          -          Замын цагдаагийн ослын акт, тодорхойлолт
          -          Холбогдогч талуудын тээврийн хэрэгслийн улсын бүртгэлийн гэрчилгээний хуулбар
          -          Жолооны үнэмлэхний хуулбар
          -          Хохирлын үнэлгээний тайлан
          -          Даатгалын гэрээ
          -          Хэрэв хуулийн этгээд бол байгууллагын нөхөн төлбөр хүссэн албан тоот
          -          Шаардлагатай бол онцгой байдлын газар, шүүх эмнэлэг зэрэг эрх бүхий байгууллагын гаргасан дүгнэлт, акт"
        />
        <Faqs
          question="Би танайд тээврийн хэрэгслийн даатгалтай өөр хүний буруугаас болоод миний машинд хохирол учирчлаа. Одоо би яах вэ?"
          answer="Жолоочийн даатгалын тухай хууль гарснаар замын хөдөлгөөнд оролцож байгаа жолооч бүр жолоочийн хариуцлагын даатгал хийлгэсэн байх ёстой бөгөөд таньд учирсан хохиролыг буруутай талын хариуцлагын даатгалаар 100% барагдуулах болно. Хэрэв таны машинд хохирол учруулсан 3дагч этгээд хариуцлагын даатгал байхгүй бол та өөрийн буруутай этгээдээс нэхэмжлэх эрхийг даатгуулагчид шилжүүлснээр тээврийн хэрэгслийн даатгалын гэрээний дагуу нөхөн төлбөр гаргуулж болно. / МУ-ын Иргэний хуулийн 443.7, Даатгалын тухай хуулийн 8.7/
          "
        />
        <Faqs
          question=" Жолоочийн хариуцлагын даатгал болон тээврийн хэрэгслийн даатгал 2 нь заавал нэг даатгалын компанид хамрагдах ёстой юу?"
          answer="Даатгалын компанийг та сонгох учир 2 даатгал 2 өөр даатгалын компанид хийлгэх боломжтой."
        />
        <Faqs
          question=" Даатгалын буцаалт хэрхэн хийх вэ?"
          answer="Тээврийн хэрэгслийг бусдад зарсан болон шилжүүлсэн тохиолдолд даатгалын гэрээг / эх хувиар/ болон даатгуулагчийн бичиг баримтын хамт даатгалын компанийхаа сэлбар нэгж дээр авчран цуцлалт хийлгэх боломжтой."
        />
        <Faqs
          question="Би өөрийн нэр дээр 5 тээврийн хэрэгсэлтэй юм. Энэ тээврийн хэрэгсэл бүр дээр даатгалд хамрагдсан байх шаардлагатай юу?"
          answer="Таны нэр дээрх 5 тээврийн хэрэгсэл бүгд зам тээврийн хөдөлгөөнд оролцдон бол бүх тээврийн хэрэгслийг даатгалд хамруулах ёстой. Хэрэв даатгалд хамрагдаагүй үед зам тээврийн хөдөлгөөнд оролцсон тохиолдолд хөдөлмөрийн хөлсний доод хэмжээний мөнгөн торгуулиар торгуулдаг."
        />
        <Faqs
          question="Нөхөн төлбөр авсан тохиолдолд дараагийн гэрээний хураамжид нөлөөлөх үү?"
          answer="Та нөхөн төлбөр авсан тохиолдолд дараагийн байгуулах гэрээний хураамж даатгалын тохиолдлын тоогоор тодорхой хувиар нэмэгддэг. Мөн нөхөн төлбөр нь тухайн эрсдэл гарсан тээврийн хэрэгсэл дээр бус жолооч дээр мэдээлэл бүртгэгддэг.
          "
        />
        <Title text="Холбоо барих" color="blue-500" />
        <MyComponentMap isMarkerShown={true} />
        <ContactInfo />
        {/* <ContactForm /> */}
      </Container>
    </div>
  );
}

export default App;
